# cbam-phead, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [24,22, 88,20, 116,33]
  - [101,49, 27,214, 202,60]
  - [292,47, 296,66, 284,86]
  - [305,110, 274,129, 253,179]

# v6 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 3, CBAMBottleneck, [1024, 3]],
   [-1, 1, SPPF, [1024, 5]],  # 10
  ]

# v6 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 14

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [256, False]], # 22 160*160  p2 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 25  80*80 p3 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],
   [-1, 3, C3, [256, False]], # 28 40*40 p4 head

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],  # 31 20*20 p5 head

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
